const yers = Number(prompt("Рік народження", ""));
if (yers) {
} else {
  confirm("Шкода, що Ви не захотіли ввести свій рік народження");
}

const live = prompt("В якому місті ви проживаєте?", "");
if (live) {
} else {
  confirm("Шкода, що Ви не захотіли ввести місто де проживаєте");
}

const sport = prompt("Улюблений вид спорту?", "");
if (sport) {
} else {
  confirm("Шкода, що Ви не захотіли ввести улюблений спорт");
}

if (live === "Київ") {
  confirm(`Ти живеш у столиці України, столицею якої є місто Київ.`);
} else if (live === "Вашингтон") {
  confirm(`Ти живеш у столиці США, столицею якої є місто  Вашингтон.`);
} else if (live === "Лондон") {
  confirm(`Ти живеш у столиці Великої Британії, столицею якої є місто Лондон.`);
} else {
  console.log(`Tи живеш у місті ${live}`);
}

if (sport === "Футбол") {
  confirm(`Круто! Хочеш стати як Кріштіану Роналду?`);
} else if (sport === "Бокс") {
  confirm(`Круто! Хочеш стати як Олександр Усік?`);
} else if (sport === "Баскетбол") {
  confirm(`Круто! Хочеш стати як Майкл Джордан?`);
} else {
  console.log(`Круто! Це гарний вид спорту ${sport}.`);
}
alert(
  `Мій рік народження: ${yers}` +
    ` ` +
    `Tи живеш у місті ${live}` +
    ` ` +
    `Круто! Це гарний вид спорту ${sport}.`
);
